#pragma once
#include"ljb.h"
#include"ljjz.h"
#include<stdlib.h>

int visit[M];/*遍历标记*/


/********************************************************/
/*	函数功能：文件读取建立图的邻接表					*/
/*	函数参数：邻接表指针g,文件名，有无向图标志			*/
/*	函数返回值：无										*/
/********************************************************/
void creat(LinkedGraph* g, char* filename, int c);


/********************************************************/
/*	函数功能：从顶点i开始深度优先遍历图的连通分量		*/
/*	函数参数：邻接表g，遍历节点起点i					*/
/*	函数返回值：无										*/
/********************************************************/
void deep_dfs(LinkedGraph g, int i);


/********************************************************/
/*	函数功能：深度优先遍历图							*/
/*	函数参数：邻接矩阵g									*/
/*	函数返回值：无										*/
/********************************************************/
void deep_DFsTraverse(LinkedGraph g);


/********************************************************/
/*	函数功能：从顶点i开始广度优先遍历图的连通分量		*/
/*	函数参数：邻接表g，遍历节点起点i					*/
/*	函数返回值：无										*/
/********************************************************/
void wide_bfs(LinkedGraph g, int i);


/********************************************************/
/*	函数功能：广度优先遍历								*/
/*	函数参数：邻接表g									*/
/*	函数返回值：返回连通分量的个数						*/
/********************************************************/
int wide_BFsTraverse(LinkedGraph g);


/********************************************************/
/*	函数功能：拓扑排序									*/
/*	函数参数：邻接表g									*/
/*	函数返回值：拓扑排序的输出顶点个数					*/
/********************************************************/
int TopSort(LinkedGraph g);


/************************************************************/
/*	函数功能：用邻接矩阵从顶点i开始深度优先遍历图的连通分量	*/
/*	函数参数：邻接矩阵G,遍历起点i							*/
/*	函数返回值：无											*/
/************************************************************/
void ljjz_DFS(Mgraph G, int i);


/********************************************************/
/*	函数功能：用邻接矩阵深度优先遍历图					*/
/*	函数参数：邻接矩阵G									*/
/*	函数返回值：无										*/
/********************************************************/
void ljjz_DFsTraverse(Mgraph G);