#pragma once
#include<graphics.h>
#include<conio.h>
#include<stdio.h>
#include<Windows.h>
#include"ljjz.h"
#include"MinTree.h"
#include"shortestpath.h"
#include"mes_search.h"
#include"keypoint.h"
#include"vall_paths.h"
#include"Bestpath_Multispot.h"
#include"GUI.h"




/********************************************************/
/*	函数功能：图片初始化界面							*/
/*	函数参数：无										*/
/*	函数返回值：无										*/
/********************************************************/
void initgraph();

/********************************************************/
/*	函数功能：界面更新									*/
/*	函数参数：无										*/
/*	函数返回值：无										*/
/********************************************************/
void upgradeGraph();

/********************************************************/
/*	函数功能：根据Out数组进行地图划线					*/
/*	函数参数：邻接矩阵G									*/
/*	函数返回值：无										*/
/********************************************************/
void makeline(Mgraph G);

/********************************************************/
/*	函数功能：鼠标点击事件								*/
/*	函数参数：											*/
/*	函数返回值：无										*/
/********************************************************/
void mouseClick();