#pragma once
#include<stdio.h>
#include"ljb.h"
#include"GUI.h"
extern int Out[M];
extern int OutSize;


/********************************************************/
/*	函数功能：输出关节点								*/
/*	函数参数：邻接表指针g,	关节点标志数组f				*/
/*	函数返回值：无										*/
/********************************************************/
void keypout(LinkedGraph* g, int f[]);


/********************************************************/
/*	函数功能：从v0点出发DFS，查找并输出关节点			*/
/*	函数参数：邻接表指针g,	第count个访问的顶点v0		*/
/*	函数返回值：无										*/
/********************************************************/
void DFSArticul(LinkedGraph g, int v0);


/********************************************************/
/*	函数功能：查找关节点								*/
/*	函数参数：邻接表指针g								*/
/*	函数返回值：无										*/
/********************************************************/
void FindArticul(LinkedGraph g);

