#pragma once
#include"ljjz.h"
/************************************************/
/*	最小生成树算法  文件名：MinTree.h			*/	
/************************************************/
typedef struct edgedate
{
	int begin, end;			/*begin end为边顶点序号*/
	int length;				/*边长度*/
}edge;

/************************************************/
/*	函数功能：prime算法构造最小生成树			*/
/*	函数参数：邻接矩阵g，边向量tree				*/
/*	函数返回值：无								*/
/************************************************/
void prim(Mgraph* g, edge tree[M - 1]);

/********************************************************/
/*	函数功能：从图g中的邻接矩阵中读取所有边信息			*/
/*	函数参数：边向量edges;邻接矩阵g						*/
/*	函数返回值：无										*/
/********************************************************/
void GetEdge(Mgraph g, edge edges[]);

/********************************************************/
/*	函数功能：kruskal求解最小生成树算法					*/
/*	函数参数：邻接矩阵g									*/
/*	函数返回值：无										*/
/********************************************************/
void kruskal(Mgraph g);
