#include"stack.h"

/************************************************/
/*	函数功能：初始化栈			                */
/*	函数参数：栈指针*s				            */
/*	函数返回值：无								*/
/************************************************/
void initstack(sqstack *s)
{
    int i;
    s->top = 0;
    for (i = 0; i <M; ++i)s->stack[i] = 0;
}

/************************************************/
/*	函数功能：入栈     			                */
/*	函数参数：栈指针*s，入栈内容n	            */
/*	函数返回值：无								*/
/************************************************/
void push(sqstack *s, int n)//入栈
{
    if(s->top>M)
    {
        printf("The sequence stack is full!");
        return;
    }
    s->stack[s->top++] = n;
}

/************************************************/
/*	函数功能：出栈     			                */
/*	函数参数：栈指针*s           	            */
/*	函数返回值：出栈内容n						*/
/************************************************/
int pop(sqstack& s)//出栈
{
    if(s.top==0)
    {
        printf("The sequence stack is empty!");
        return NULL;
    }
    return s.stack[s.top--];
}
