#pragma once
#include<stdio.h>
#include"ljjz.h"
typedef struct
{
   int  top;
   int stack[M];
}sqstack;

/************************************************/
/*	函数功能：初始化栈			                */
/*	函数参数：栈指针*s				            */
/*	函数返回值：无								*/
/************************************************/
void initstack(sqstack* s);


/************************************************/
/*	函数功能：入栈     			                */
/*	函数参数：栈指针*s，入栈内容n	            */
/*	函数返回值：无								*/
/************************************************/
void push(sqstack* s, int n);

/************************************************/
/*	函数功能：出栈     			                */
/*	函数参数：栈指针*s           	            */
/*	函数返回值：出栈内容n						*/
/************************************************/
int pop(sqstack& s);
